# Найдите сумму цифр трехзначного числа.

num = input("Введите 3-хзначное число: ")

sum = int (num[0]) + int (num[1]) + int (num[2])

print (f"Сумма цифр числа {num} равна {sum}")